/**
 * @license
 * SPDX-License-Identifier: Apache-2.0
*/
export default {
  renaissance: {
    name: 'رنسانس',
    emoji: '🎨',
    prompt: 'شخص داخل عکس را شبیه به یک نقاشی رنسانس کن.'
  },

  cartoon: {
    name: 'کارتون',
    emoji: '😃',
    prompt:
      'این تصویر را به یک کارتون ساده و بامزه تبدیل کن. از خطوط کم و رنگ‌های یکدست استفاده کن.'
  },

  statue: {
    name: 'مجسمه',
    emoji: '🏛️',
    prompt:
      'شخص را شبیه به یک مجسمه مرمری کلاسیک کن، شامل لباس و چشم‌ها.'
  },

  banana: {
    name: 'موز',
    emoji: '🍌',
    prompt: 'کاری کن شخص داخل عکس لباس موزی بپوشد.'
  },

  '80s': {
    name: 'دهه ۸۰',
    emoji: '✨',
    prompt:
      'شخص داخل عکس را شبیه به عکس سالنامه دهه ۱۹۸۰ کن. می‌توانی مدل مو و لباس را تغییر دهی.'
  },

  '19century': {
    name: 'قرن ۱۹',
    emoji: '🎩',
    prompt:
      'عکس را شبیه به یک داگرئوتایپ قرن نوزدهم کن. می‌توانی پس‌زمینه را برای تناسب با دوره تغییر دهی و وسایلی مانند لباس‌های ویکتوریایی اضافه کنی. سعی کن پرسپکتیو را حفظ کنی.'
  },

  anime: {
    name: 'انیمه',
    emoji: '🍣',
    prompt:
      'شخص داخل عکس را شبیه به یک شخصیت انیمه فوتورئالیستی با ویژگی‌های اغراق‌آمیز کن.'
  },

  psychedelic: {
    name: 'روانگردان',
    emoji: '🌈',
    prompt:
      "یک تصویرسازی به سبک پوستر روانگردان دهه ۱۹۶۰ با رنگ‌های تند و شاد و اشکال چرخشی بر اساس این تصویر ایجاد کن. هیچ متنی اضافه نکن."
  },

  '8bit': {
    name: '۸ بیتی',
    emoji: '🎮',
    prompt:
      'این تصویر را به یک صحنه پیکسل آرت ۸ بیتی مینیمالیستی، بامزه و با رنگ‌های روشن در یک گرید ۸۰x۸۰ پیکسلی تبدیل کن.'
  },

  beard: {
    name: 'ریش بزرگ',
    emoji: '🧔🏻',
    prompt: 'کاری کن شخص داخل عکس ریش بسیار بزرگی داشته باشد.'
  },

  comic: {
    name: 'کتاب کمیک',
    emoji: '💥',
    prompt:
      'عکس را به یک پنل کتاب کمیک با خطوط ضخیم، نقطه‌های هافتون و حباب‌های گفتگو تبدیل کن.'
  },

  old: {
    name: 'پیر',
    emoji: '👵🏻',
    prompt: 'کاری کن شخص داخل عکس بسیار پیر به نظر برسد.'
  }
}